                                PROCESO ETL PI (PHYTON- PANDAS- MYSQL)

PASO 1 </br>
En este paso vamos a cargar todos los datasets en crudo

    Importamos la libreria necesaria

In [106]:
import pandas as pd

    Guardamos en un dataframe de pandas los diferentes datasets cargados y visualizamos con head() su estructura

In [107]:
precios_semana_20200413 = pd.read_csv('Datasets\precios_semana_20200413.csv', sep= ',', encoding='utf-16') 
precios_semana_20200413.head(10)

   precio    producto_id sucursal_id
0   29.90  0000000001663     2-1-014
1   29.90  0000000002288     2-1-032
2   39.90  0000000002288     2-1-096
3  499.99  0000000205870     9-1-686
4  519.99  0000000205870     9-2-248
5  539.99  0000000205870      9-2-42
6  539.99  0000000205870     9-3-628
7  589.99  0000000205894     9-1-686
8  189.99  0000000205955     9-1-686
9  104.99  0000000205979     9-1-686

In [108]:
precios_semana_20200503 = pd.read_json('Datasets\precios_semana_20200503.json')
precios_semana_20200503.head(10)

   precio    producto_id sucursal_id
0    29.9  0000000002288     2-1-187
1    39.9  0000000002288     2-3-247
2  499.99  0000000205870     9-1-685
3  539.99  0000000205870      9-2-22
4  519.99  0000000205870      9-2-59
5  539.99  0000000205870     9-3-138
6  589.99  0000000205894     9-1-685
7  189.99  0000000205955     9-1-685
8  104.99  0000000205979     9-1-685
9     229  0000000206020     9-1-685

In [109]:
precios_semana_20200518 = pd.read_csv('Datasets\precios_semana_20200518.txt', sep= '|')
precios_semana_20200518.head(10)

   precio    producto_id sucursal_id
0   29.90  0000000002288     2-1-009
1   32.90  0000000002288     2-1-037
2   36.90  0000000002288     2-1-090
3   39.90  0000000002288     2-3-247
4  499.99  0000000205870     9-1-430
5  539.99  0000000205870       9-2-4
6  539.99  0000000205870    9-3-5205
7  589.99  0000000205894     9-1-430
8  189.99  0000000205955     9-1-430
9  104.99  0000000205979     9-1-430

In [ ]:
precios_semanas = pd.read_excel('Datasets\precios_semanas_20200419_20200426.xlsx', sheet_name=None) 
precios_20200419_20200426 = pd.concat(precios_semanas, ignore_index=True)

In [110]:
precios_20200419_20200426.head(10)

    precio sucursal_id    producto_id
0    399.0     2-1-092  0000000002288
1    299.0     2-1-206  0000000002288
2    399.0     2-2-241  0000000002288
3  49999.0      9-1-43  0000000020587
4  53999.0       9-2-4  0000000020587
5  53999.0    9-3-5218  0000000020587
6  58999.0      9-1-43  0000000205894
7  18999.0      9-1-43  0000000205955
8  10499.0      9-1-43  0000000205979
9   2290.0      9-1-43  0000000020602

In [111]:
producto = pd.read_parquet('Datasets\producto.parquet')
producto.head(10)

,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
0,0000000001663,LA ANÓNIMA,Radicheta Atada La Anonima 1 Un,1.0 un,None,None,None
1,0000000002288,LA ANÓNIMA,Perejil Atado La Anonima 1 Un,1.0 un,None,None,None
2,0000000205870,SIN MARCA,Ojo de Bife 1 Kg,1.0 kg,None,None,None
3,0000000205894,SIN MARCA,Milanesa de Peceto Novillito 1 Kg,1.0 kg,None,None,None
4,0000000205955,SIN MARCA,Chiquizuela Novillito 1 Kg,1.0 kg,None,None,None
5,0000000205979,SIN MARCA,Espinazo de Novillito 1 Kg,1.0 kg,None,None,None
6,0000000206020,SIN MARCA,Carnanza Comun de Novillo 1 Kg,1.0 kg,None,None,None
7,0000000206044,SIN MARCA,Falda Deshuesada Novillito Bandeja 1 Kg,1.0 kg,None,None,None
8,0000000206051,SIN MARCA,Carne Picada Comun 1 Kg,1.0 kg,None,None,None
9,0000000206105,SIN MARCA,Entraña de Novillito 1 Kg,1.0 kg,None,None,None

In [112]:
sucursal = pd.read_csv('Datasets\sucursal.csv')
sucursal.head(10)

,id,comercioId,banderaId,banderaDescripcion,comercioRazonSocial,provincia,localidad,direccion,lat,lng,sucursalNombre,sucursalTipo
0,1-1-7,1,1,Super MAMI,Dinosaurio S.A.,AR-X,SALSIPUEDES,E53 1011 None,-31.126667,-64.295250,Super Mami 4,Hipermercado
1,10-1-1,10,1,Hipermercado Carrefour,INC S.A.,AR-B,San Isidro,Bernardo De Irigoyen 2647,-34.491345,-58.589025,San Isidro,Hipermercado
2,10-1-10,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Hurlingham,Av. Vergara 1910,-34.620610,-58.633769,Villa Tesei,Hipermercado
3,10-1-11,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Malvinas Argentinas,Av. Arturo Illia 3770,-34.528883,-58.701631,Malvinas Argentinas,Hipermercado
4,10-1-112,10,1,Hipermercado Carrefour,INC S.A.,AR-A,Salta,20 De Febrero 37,-24.789072,-65.413699,Salta,Hipermercado
5,10-1-12,10,1,Hipermercado Carrefour,INC S.A.,AR-B,San Justo,Av. Don Bosco 2680,-34.664628,-58.597356,San Justo,Hipermercado
6,10-1-123,10,1,Hipermercado Carrefour,INC S.A.,AR-J,San Juan,Gral. Acha 32,-31.534016,-68.524744,San Juan,Supermercado
7,10-1-128,10,1,Hipermercado Carrefour,INC S.A.,AR-U,Comodoro Rivadavia,Pellegrini 851,-45.861562,-67.479968,Comodoro Rivadavia,Hipermercado
8,10-1-136,10,1,Hipermercado Carrefour,INC S.A.,AR-R,General Roca,25 De Mayo 622,-39.030326,-67.573775,General Roca,Supermercado
9,10-1-139,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Olavarría,Rivadavia 2846,-36.893694,-60.321650,Olavarría,Hipermercado

PASO 2 </br>
En este paso vamos a visualizar la informacion general de los datasets, sus valores nulos, tipo de datos, etc

    Vamos a visualizar la informacion general de cada dataframe y adicional vamos a contar cuantos valores nulos tiene cada uno

In [113]:
precios_semana_20200413.info()
print('-------------------------------')
precios_semana_20200413.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 472166 entries, 0 to 472165
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   precio       472153 non-null  float64
 1   producto_id  472151 non-null  object
 2   sucursal_id  472151 non-null  object
dtypes: float64(1), object(2)
memory usage: 10.8+ MB
-------------------------------

precio         13
producto_id    15
sucursal_id    15
dtype: int64

In [114]:
precios_semana_20200503.info()
print('-------------------------------')
precios_semana_20200503.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397734 entries, 0 to 397733
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   precio       397734 non-null  object
 1   producto_id  397734 non-null  object
 2   sucursal_id  397734 non-null  object
dtypes: object(3)
memory usage: 9.1+ MB
-------------------------------

precio         0
producto_id    0
sucursal_id    0
dtype: int64

In [115]:
precios_semana_20200518.info()
print('-------------------------------')
precios_semana_20200518.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 415293 entries, 0 to 415292
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   precio       413333 non-null  float64
 1   producto_id  415287 non-null  object
 2   sucursal_id  415287 non-null  object
dtypes: float64(1), object(2)
memory usage: 9.5+ MB
-------------------------------

precio         1960
producto_id       6
sucursal_id       6
dtype: int64

In [116]:
precios_20200419_20200426.info()
print('-------------------------------')
precios_20200419_20200426.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 937452 entries, 0 to 937451
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   precio       937452 non-null  float64
 1   sucursal_id  937452 non-null  string
 2   producto_id  937452 non-null  string
dtypes: float64(1), string(2)
memory usage: 21.5 MB
-------------------------------

precio         0
sucursal_id    0
producto_id    0
dtype: int64

In [117]:
producto.info()
print('-------------------------------')
producto.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72038 entries, 0 to 72037
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            72038 non-null  object
 1   marca         72036 non-null  object
 2   nombre        72036 non-null  object
 3   presentacion  72036 non-null  object
 4   categoria1    4 non-null      object
 5   categoria2    4 non-null      object
 6   categoria3    4 non-null      object
dtypes: object(7)
memory usage: 3.8+ MB
-------------------------------

id                  0
marca               2
nombre              2
presentacion        2
categoria1      72034
categoria2      72034
categoria3      72034
dtype: int64

In [118]:
sucursal.info()
print('-------------------------------')
sucursal.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2333 entries, 0 to 2332
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   2333 non-null   object
 1   comercioId           2333 non-null   int64
 2   banderaId            2333 non-null   int64
 3   banderaDescripcion   2333 non-null   object
 4   comercioRazonSocial  2333 non-null   object
 5   provincia            2333 non-null   object
 6   localidad            2333 non-null   object
 7   direccion            2333 non-null   object
 8   lat                  2333 non-null   float64
 9   lng                  2333 non-null   float64
 10  sucursalNombre       2333 non-null   object
 11  sucursalTipo         2333 non-null   object
dtypes: float64(2), int64(2), object(8)
memory usage: 218.8+ KB
-------------------------------

id                     0
comercioId             0
banderaId              0
banderaDescripcion     0
comercioRazonSocial    0
provincia              0
localidad              0
direccion              0
lat                    0
lng                    0
sucursalNombre         0
sucursalTipo           0
dtype: int64

PASO 3 </br>
En este paso vamos a transformar los datos y limpiar un poco cada dataframe

    Imputamos valores faltantes en cada columna del dataframe con valores faltantes por cada uno de los dataframes

In [119]:
precios_semana_20200413["precio"].fillna(0, inplace= True)
precios_semana_20200413["producto_id"].fillna('SIN DATO' , inplace=True)
precios_semana_20200413["sucursal_id"].fillna('SIN DATO' , inplace=True)

In [120]:
precios_semana_20200503['precio'].replace('', 0, inplace=True) #Esto es porque en el dataframe hay espacios que no se reconocen como nulos.

In [121]:
precios_semana_20200518["precio"].fillna(0, inplace= True)
precios_semana_20200518["producto_id"].fillna('SIN DATO' , inplace=True)
precios_semana_20200518["sucursal_id"].fillna('SIN DATO' , inplace=True)

In [122]:
precios_20200419_20200426["precio"].fillna(0, inplace= True)
precios_20200419_20200426["producto_id"].fillna('SIN DATO' , inplace=True)
precios_20200419_20200426["sucursal_id"].fillna('SIN DATO' , inplace=True)

precios_20200419_20200426['precio'].replace('', 0, inplace=True)
precios_20200419_20200426["producto_id"].replace('' ,'SIN DATO', inplace=True)
precios_20200419_20200426['sucursal_id'].replace('' ,'SIN DATO', inplace=True)

In [123]:
producto.fillna('SIN DATO', inplace= True)

    Vamos a cambiar el tipo de dato en las columnas que no coincidan con el dato que poseen

In [124]:
precios_semana_20200413['producto_id'] = precios_semana_20200413['producto_id'].astype('string')
precios_semana_20200413['sucursal_id'] = precios_semana_20200413['sucursal_id'].astype('string')

In [125]:
precios_semana_20200503['precio'] = precios_semana_20200503['precio'].astype('float64')  
precios_semana_20200503['producto_id'] = precios_semana_20200503['producto_id'].astype('string')
precios_semana_20200503['sucursal_id'] = precios_semana_20200503['sucursal_id'].astype('string')

In [126]:
precios_semana_20200518['producto_id'] = precios_semana_20200518['producto_id'].astype('string')
precios_semana_20200518['sucursal_id'] = precios_semana_20200518['sucursal_id'].astype('string')

In [127]:
precios_20200419_20200426['producto_id'] = precios_20200419_20200426['producto_id'].astype('string')
precios_20200419_20200426['sucursal_id'] = precios_20200419_20200426['sucursal_id'].astype('string')

In [128]:
producto['id'] = producto['id'].astype('string')
producto['marca'] = producto['marca'].astype('string')
producto['nombre'] = producto['nombre'].astype('string')
producto['presentacion'] = producto['presentacion'].astype('string')
producto['categoria1'] = producto['categoria1'].astype('string')
producto['categoria2'] = producto['categoria2'].astype('string')
producto['categoria3'] = producto['categoria3'].astype('string')

In [129]:
sucursal['id'] = sucursal['id'].astype('string')
sucursal['comercioId'] = sucursal['comercioId'].astype('int64')
sucursal['banderaDescripcion'] = sucursal['banderaDescripcion'].astype('string')
sucursal['banderaId'] = sucursal['banderaId'].astype('int64')
sucursal['comercioRazonSocial'] = sucursal['comercioRazonSocial'].astype('string')
sucursal['provincia'] = sucursal['provincia'].astype('string')
sucursal['localidad'] = sucursal['localidad'].astype('string')
sucursal['direccion'] = sucursal['direccion'].astype('string')
sucursal['lat'] = sucursal['lat'].astype('float64')
sucursal['sucursalNombre'] = sucursal['sucursalNombre'].astype('string')
sucursal['sucursalTipo'] = sucursal['sucursalTipo'].astype('string')

    Normalizamos las columnas de cada dataframe para cambiar los datos y darles la estructura necesaria para una correcta visualizacion y analisis

In [130]:
precios_20200419_20200426['producto_id'] = precios_20200419_20200426['producto_id'].astype('string').str.rstrip('.0')#Quitamos los .0 que hay en la columna
precios_20200419_20200426['producto_id'] = precios_20200419_20200426['producto_id'].str.zfill(13)#Al inicio llenamos con 0 hasta que hayan 13 digitos

In [131]:
precios_20200419_20200426['sucursal_id'] = precios_20200419_20200426['sucursal_id'].astype('string').str.rstrip('00:00:00')#Quitamos el formato de fecha

In [132]:
precios_20200419_20200426.head(10)

    precio sucursal_id    producto_id
0    399.0     2-1-092  0000000002288
1    299.0     2-1-206  0000000002288
2    399.0     2-2-241  0000000002288
3  49999.0      9-1-43  0000000020587
4  53999.0       9-2-4  0000000020587
5  53999.0    9-3-5218  0000000020587
6  58999.0      9-1-43  0000000205894
7  18999.0      9-1-43  0000000205955
8  10499.0      9-1-43  0000000205979
9   2290.0      9-1-43  0000000020602

PASO 4 </br>
En este paso vamos a exportar los dataframes a un tipo de archivo .csv para cargarlo en nuestro gestor de bases de datos

In [133]:
precios_semana_20200413.to_csv('CSV\precios_semana_20200413',index=False, encoding='latin1')

In [134]:
precios_semana_20200503.to_csv('CSV\precios_semana_20200503',index=False, encoding='latin1')

In [135]:
precios_semana_20200518.to_csv('CSV\precios_semana_20200518',index=False, encoding='latin1')

In [136]:
producto.to_csv('CSV\producto', index = False, sep=';' ,encoding = 'UTF-8')

In [137]:
sucursal.to_csv('CSV\sucursal', index = False, sep=';' ,encoding = 'UTF-8')

PASO 6 </br>
En este paso vamos a cargar con SQLALCHEMY el csv generado de la transformacion del dataset de precios_20200419_20200426

In [138]:
import pymysql
from sqlalchemy import create_engine

cadena_conexion = 'mysql+pymysql://root:root@localhost:3306/proyecto_individual' #Creamos la cadena de conexion que sera el path de nuestra base de datos

conexion= create_engine(cadena_conexion) #creamos la conexion con mysql

In [139]:
precios_20200419_20200426.to_sql(name='precios_semana_20200419_20200426', con=conexion, index=False) #Creamos la tabla en mysql

937452

PLUS </br>
Con este codigo simplemente pasas la ruta del archivo a cargar y este te lo almacena en un dataframe de pandas y te lo exporta a csv :p</br>
Nota: A algunos de los path vas a tener que pasarle su enconding, o separador.

In [ ]:
import os
def Automatizacion ():
        archivo = input('Ingrese el path del archivo')
        split_tup = os.path.splitext(archivo) 
        nombre_archivo = split_tup[0] 
        extension_archivo = split_tup[1] 

        if (extension_archivo == '.csv'):
                e = input('ingrese el enconding del csv')
                df_csv = pd.read_csv(archivo, encoding=e)
                print('csv cargado con exito')

                df_csv.to_csv(nombre_archivo, index = False, sep=';' ,encoding = 'UTF-8')
                print('Convertido a csv')

        if (extension_archivo == '.json'):
                df_json = pd.read_json(archivo)    
                print('json cargado con exito')

                df_json.to_csv(nombre_archivo, index = False, sep=';' ,encoding = 'UTF-8')
                print('Convertido a csv')

        if (extension_archivo == '.txt'):
                s = input('ingrese el tipo de separador del txt')
                df_txt = pd.read_csv(archivo, sep=s)    
                print('txt cargado con exito')

                df_txt.to_csv(nombre_archivo, index = False, sep=';' ,encoding = 'UTF-8')
                print('Convertido a csv')

        if (extension_archivo == '.parquet'):
                df_parquet = pd.read_parquet(archivo)    
                print('parquet cargado con exito')

                df_parquet.to_csv(nombre_archivo, index = False, sep=';' ,encoding = 'UTF-8')
                print('Convertido a csv')

        if (extension_archivo == '.xlsx'):
                df = pd.read_excel(archivo, sheet_name=None)
                df_excel = pd.concat(df, ignore_index=True) 
                print('excel cargado con exito') 

                df_excel.to_csv(nombre_archivo, index = False, sep=';' ,encoding = 'UTF-8')
                print('Convertido a csv')